app/controllers/odisseias_controller.rb

  def create
    @odisseia = Odisseia.new(odisseia_params)

    if @odisseia.save
---
INSERT INTO `odisseias` (`texto`, `fonte`, `created_at`, `updated_at`) VALUES ('', '', '2019-02-25 14:08:02', '2019-02-25 14:08:02')

  def destroy
    if @odisseia.destroy
---
DELETE FROM `odisseias` WHERE `odisseias`.`id` = 1

    def set_odisseia
      @odisseia = Odisseia.find(params[:id])
---
SELECT  `odisseias`.* FROM `odisseias` WHERE `odisseias`.`id` = 1 LIMIT 1