app/controllers/perfis_controller.rb

  def update
    if @perfil.update(perfil_params)
---
UPDATE `perfis` SET `descricao` = 'Administrador', `updated_at` = '2019-02-27 17:12:29' WHERE `perfis`.`id` = 2