app/controllers/recursos_controller.rb

    def set_recurso
      @recurso = Recurso.find(params[:id])
---
SELECT  `recursos`.* FROM `recursos` WHERE `recursos`.`id` = 2 LIMIT 1