app/controllers/usuarios_controller.rb

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 0 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])