app/models/usuario.rb

  def self.from_omniauth(auth)
    usuario = find_or_initialize_by(login: auth.info.username)
    return usuario unless usuario.new_record?

    usuario.nome = "#{auth.extra.first_name.strip} #{auth.extra.last_name.strip}"
    usuario.email = auth.info.email
    usuario.password = Devise.friendly_token
    usuario.save! && usuario
---
SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`login` = '103564' LIMIT 1
INSERT INTO `usuarios` (`nome`, `login`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES ('Bruno Henrique Borges', '103564', '2019-03-11 15:08:11', '2019-03-11 15:08:11', 'brunoborges@claretiano.edu.br', '$2a$11$YC3/Fs5AsL2FNF6B2h6IVO31.6Nb0fDvP2gnUZLK8pivwkGDumcRi')